<?php

return [
    'login'=>
    [
        'success'=>
        [
            'code'=>0,
            'msg'=>'登录成功',
        ],
        'error'=>
        [
            '10001'=>[
                'code'=>10001,
                'msg'=>'用户不存在'
            ]
        ]

    ],
    'mysql'=>
    [
        'restart'=>
        [
            'code'=>0,
            'msg'=>'重置成功',
        ],
        'increase'=>
        [
            'code'=>0,
            'msg'=>'添加成功',
        ],

        'update'=>
        [
            'code'=>0,
            'msg'=>'更新成功',
        ],

        'select'=>
        [
            'code'=>0,
            'msg'=>'查询成功',
        ],

        'delete'=>
        [
            'code'=>0,
            'msg'=>'删除成功',
        ],

        'error'=>
        [
            '90000'=>
            [
                'code'=>90000,
                'msg'=>'重置失败',
            ],
            '90001'=>
            [
                'code'=>90001,
                'msg'=>'未传入表名参数',
            ],

            '90002'=>
            [
                'code'=>90002,
                'msg'=>'未传入有效数据',
            ],

            '90003'=>
            [
                'code'=>90003,
                'msg'=>'未传入有效数据',
            ],

            '90004'=>
            [
                'code'=>90004,
                'msg'=>'数据传递格式有误',
            ],

             '90005'=>
            [
                'code'=>90005,
                'msg'=>'添加失败',
            ],

            '90006'=>
            [
                'code'=>90006,
                'msg'=>'添加失败',
            ],

            '90007'=>
            [
                'code'=>90007,
                'msg'=>'删除失败',
            ],

            '90008'=>
            [
                'code'=>90008,
                'msg'=>'查询失败',
            ],

            '90009'=>
            [
                'code'=>90009,
                'msg'=>'删除失败,缺失必要参数',
            ],

             '90010'=>
            [
                'code'=>90010,
                'msg'=>'删除失败',
            ],

            '90011'=>
            [
                'code'=>90011,
                'msg'=>'联查参数设置错误',
            ],

            '90012'=>
            [
                'code'=>90012,
                'msg'=>'联查参数设置错误',
            ],

            '90013'=>
            [
                'code'=>90013,
                'msg'=>'联查参数设置错误',
            ],

            '90014'=>
            [
                'code'=>90014,
                'msg'=>'联查参数设置错误',
            ],

            '90015'=>
            [
                'code'=>90015,
                'msg'=>'联查参数设置错误',
            ],

            '90016'=>
            [
                'code'=>90016,
                'msg'=>'联查失败',
            ],

            '90021'=>
            [
                'code'=>90021,
                'msg'=>'where条件参数有误!',
            ],

            '90022'=>
            [
                'code'=>90022,
                'msg'=>'orWhere条件参数有误!',
            ],

            '90023'=>
            [
                'code'=>90023,
                'msg'=>'orWhere条件参数有误!',
            ],

            '90024'=>
            [
                'code'=>90024,
                'msg'=>'whereIn条件参数有误!',
            ],

            '90025'=>
            [
                'code'=>90025,
                'msg'=>'whereIn条件参数有误!',
            ],
           
        ]

    ]
];